app/views/comments/_element.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY posts_count desc LIMIT 1
---
        </span>
		<span class="posted">Written by <%= element.user.blank? ? element.username : link_to(element.user.username, element.user) %></span>