app/views/users/index.html.erb

<% @users.each do |user| %>
	<h1><%= link_to user.username, user %> (Posts: <%= user.posts.count %>)</h1>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
SELECT COUNT(*) FROM "users"