app/views/users/show.html.erb

			<br />
			<% unless post.tags.blank? %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."post_id" = 1