app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggables" ON "tags"."id" = "taggables"."tag_id" WHERE "taggables"."post_id" = 1
---
			<br />
			<% unless post.tags.blank? %>