app/controllers/feeds_controller.rb

  def index
    @posts = Post.limit 50
    @title = "Weblog - last posts"
    @updated = @posts.first.created_at unless @posts.empty?
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 50
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "posts" LIMIT 50) subquery_for_count