app/controllers/posts_controller.rb

	def index
		@posts = Post.order('created_at DESC').page params[:page]
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "posts"

	def create
		@post = current_user.posts.new(params[:post])
		if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "raz raz"], ["created_at", Sat, 25 Feb 2012 11:17:03 UTC +00:00], ["title", "raz raz"], ["updated_at", Sat, 25 Feb 2012 11:17:03 UTC +00:00], ["user_id", 1]]

	def find_post
		@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1-raz-raz"]]