app/controllers/tags_controller.rb

	def show
		@tag = Tag.find_by_name(params[:id])
		@posts = @tag.posts.order(:id).page params[:page] rescue []
---
SELECT "tags".* FROM "tags" WHERE "tags"."name" = 'tag' LIMIT 1
SELECT "posts".* FROM "posts" INNER JOIN "taggables" ON "posts"."id" = "taggables"."post_id" WHERE "taggables"."tag_id" = 1 ORDER BY created_at DESC, id LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "posts" INNER JOIN "taggables" ON "posts"."id" = "taggables"."post_id" WHERE "taggables"."tag_id" = 1 LIMIT 25 OFFSET 0) subquery_for_count