app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY posts_count desc, id LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def index
		@users = User.order(:id).page params[:page]

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY posts_count desc LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 ORDER BY created_at DESC LIMIT 25 OFFSET 0
SELECT "users".* FROM "users" ORDER BY posts_count desc LIMIT 5
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = 1
---
	def show
		@user = User.find(params[:id])
		@posts = @user.posts.page params[:page]

INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "posts_count", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
	  @user = User.new(params[:user])
	  if @user.save